Show / Hide Table of Contents
Class MemberHiddenClientFactory
Inheritance
System.Object
MemberHiddenClientFactory
Implements
IMemberCalculatorFactory
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaStatiCa.Plugin
Assembly: IdeaStatiCa.Plugin.dll
Syntax
public class MemberHiddenClientFactory : IMemberCalculatorFactory
Constructors
Improve this Doc   View Source
MemberHiddenClientFactory(String)
Declaration
public MemberHiddenClientFactory(string ideaInstallDir)
Parameters
 Type |  Name |  Description
 System.String |  ideaInstallDir
Methods
Improve this Doc   View Source
Create()
Declaration
public MemberHiddenCheckClient Create()
Returns
 Type |  Description
 MemberHiddenCheckClient
Implements
 IMemberCalculatorFactory
 Improve this Doc
 View Source